Autodesk.Revit.DB.Architecture.RailExtensionStyle
The extension style of the rail.
Since:
2013

Autodesk.Revit.DB.Architecture.RailExtensionStyle.Post
The rail extends to post.

Autodesk.Revit.DB.Architecture.RailExtensionStyle.Floor
The rail extends to floor.

Autodesk.Revit.DB.Architecture.RailExtensionStyle.Wall
The rail extends to wall.

Autodesk.Revit.DB.Architecture.RailExtensionStyle.None
The rail extends to nothing